// generate by structure_parser.py at 2022-01-06 13:35:06
#ifndef __WF_RX_DESCRIPTOR_REGS_H__
#define __WF_RX_DESCRIPTOR_REGS_H__
/*
 * Copyright (c) 2022, MediaTek Inc. All rights reserved.
 *
 * This software/firmware and related documentation ("MediaTek Software") are
 * protected under relevant copyright laws.
 * The information contained herein is confidential and proprietary to
 * MediaTek Inc. and/or its licensors.
 * Except as otherwise provided in the applicable licensing terms with
 * MediaTek Inc. and/or its licensors, any reproduction, modification, use or
 * disclosure of MediaTek Software, and information contained herein, in whole
 * or in part, shall be strictly prohibited.
*/

#ifdef __cplusplus
extern "C" {
#endif // __cplusplus

#ifndef REG_BASE_C_MODULE
// ----------------- WF_RX_DESCRIPTOR Bit Field Definitions -----------------

#define PACKING
typedef uint32_t UINT32;
typedef unsigned int FIELD;

typedef PACKING union
{
    PACKING struct
    {
        FIELD rx_byte_count             : 16; // 15- 0
        FIELD cosr                      :  1; // 16-16
        FIELD rsvd_26_17                : 10; // 26-17
        FIELD packet_type               :  5; // 31-27
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_DW00, *PREG_WF_RX_DESCRIPTOR_DW00; // DW0

typedef PACKING union
{
    PACKING struct
    {
        FIELD mld_id                    : 12; // 11- 0
        FIELD rsvd_15_12                :  4; // 15-12
        FIELD group_vld                 :  5; // 20-16
        FIELD kid                       :  2; // 22-21
        FIELD cm                        :  1; // 23-23
        FIELD clm                       :  1; // 24-24
        FIELD i                         :  1; // 25-25
        FIELD t                         :  1; // 26-26
        FIELD bn                        :  2; // 28-27
        FIELD bipn_fail                 :  1; // 29-29
        FIELD rsvd_31_30                :  2; // 31-30
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_DW01, *PREG_WF_RX_DESCRIPTOR_DW01; // DW1

typedef PACKING union
{
    PACKING struct
    {
        FIELD bssid                     :  6; //  5- 0
        FIELD rsvd_06_06                :  1; //  6- 6
        FIELD h                         :  1; //  7- 7
        FIELD header_length             :  5; // 12- 8
        FIELD ho                        :  3; // 15-13
        FIELD sec_mode                  :  5; // 20-16
        FIELD mubar                     :  1; // 21-21
        FIELD swbit                     :  1; // 22-22
        FIELD daf                       :  1; // 23-23
        FIELD el                        :  1; // 24-24
        FIELD htf                       :  1; // 25-25
        FIELD intf                      :  1; // 26-26
        FIELD frag                      :  1; // 27-27
        FIELD nul                       :  1; // 28-28
        FIELD ndata                     :  1; // 29-29
        FIELD namp                      :  1; // 30-30
        FIELD bf_rpt                    :  1; // 31-31
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_DW02, *PREG_WF_RX_DESCRIPTOR_DW02; // DW2

typedef PACKING union
{
    PACKING struct
    {
        FIELD rxv_sn                    :  8; //  7- 0
        FIELD ch_frequency              :  8; // 15- 8
        FIELD a1_type                   :  2; // 17-16
        FIELD htc                       :  1; // 18-18
        FIELD tcl                       :  1; // 19-19
        FIELD bbm                       :  1; // 20-20
        FIELD bu                        :  1; // 21-21
        FIELD co_ant                    :  1; // 22-22
        FIELD bf_cqi                    :  1; // 23-23
        FIELD fc                        :  1; // 24-24
        FIELD rsvd_25_25                :  1; // 25-25
        FIELD ip                        :  1; // 26-26
        FIELD ut                        :  1; // 27-27
        FIELD rsvd_29_28                :  2; // 29-28
        FIELD smesh                     :  1; // 30-30
        FIELD vlan                      :  1; // 31-31
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_DW03, *PREG_WF_RX_DESCRIPTOR_DW03; // DW3

typedef PACKING union
{
    PACKING struct
    {
        FIELD pf                        :  2; //  1- 0
        FIELD mac                       :  1; //  2- 2
        FIELD tid                       :  4; //  6- 3
        FIELD ether_type_offset         :  8; // 14- 7
        FIELD rsvd_15_15                :  1; // 15-15
        FIELD pse_fid                   : 13; // 28-16
        FIELD rsvd_31_29                :  3; // 31-29
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_DW04, *PREG_WF_RX_DESCRIPTOR_DW04; // DW4

typedef PACKING union
{
    PACKING struct
    {
        FIELD rsvd_31_00                : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_DW05, *PREG_WF_RX_DESCRIPTOR_DW05; // DW5

typedef PACKING union
{
    PACKING struct
    {
        FIELD cls_bitmap_31_0_          : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_PF_DW06, *PREG_WF_RX_DESCRIPTOR_PF_DW06; // DW6

typedef PACKING union
{
    PACKING struct
    {
        FIELD cls_bitmap_33_32_         :  2; //  1- 0
        FIELD rsvd_18_02                : 17; // 18- 2
        FIELD dp                        :  1; // 19-19
        FIELD cls                       :  1; // 20-20
        FIELD ofld                      :  2; // 22-21
        FIELD mgc                       :  1; // 23-23
        FIELD wol                       :  5; // 28-24
        FIELD pf_mode                   :  1; // 29-29
        FIELD pf_sts                    :  2; // 31-30
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_PF_DW07, *PREG_WF_RX_DESCRIPTOR_PF_DW07; // DW7

typedef PACKING union
{
    PACKING struct
    {
        FIELD frame_control_field       : 16; // 15- 0
        FIELD peer_mld_address_15_0_    : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP4_DW08, *PREG_WF_RX_DESCRIPTOR_GROUP4_DW08; // DW8

typedef PACKING union
{
    PACKING struct
    {
        FIELD peer_mld_address_47_16_   : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP4_DW09, *PREG_WF_RX_DESCRIPTOR_GROUP4_DW09; // DW9

typedef PACKING union
{
    PACKING struct
    {
        FIELD fragment_number           :  4; //  3- 0
        FIELD sequence_number           : 12; // 15- 4
        FIELD qos_control_field         : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP4_DW10, *PREG_WF_RX_DESCRIPTOR_GROUP4_DW10; // DW10

typedef PACKING union
{
    PACKING struct
    {
        FIELD ht_control_field          : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP4_DW11, *PREG_WF_RX_DESCRIPTOR_GROUP4_DW11; // DW11

typedef PACKING union
{
    PACKING struct
    {
        FIELD pn_31_0_                  : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP1_DW12, *PREG_WF_RX_DESCRIPTOR_GROUP1_DW12; // DW12

typedef PACKING union
{
    PACKING struct
    {
        FIELD pn_63_32_                 : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP1_DW13, *PREG_WF_RX_DESCRIPTOR_GROUP1_DW13; // DW13

typedef PACKING union
{
    PACKING struct
    {
        FIELD pn_95_64_                 : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP1_DW14, *PREG_WF_RX_DESCRIPTOR_GROUP1_DW14; // DW14

typedef PACKING union
{
    PACKING struct
    {
        FIELD pn_127_96_                : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP1_DW15, *PREG_WF_RX_DESCRIPTOR_GROUP1_DW15; // DW15

typedef PACKING union
{
    PACKING struct
    {
        FIELD timestamp                 : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP2_DW16, *PREG_WF_RX_DESCRIPTOR_GROUP2_DW16; // DW16

typedef PACKING union
{
    PACKING struct
    {
        FIELD crc                       : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP2_DW17, *PREG_WF_RX_DESCRIPTOR_GROUP2_DW17; // DW17

typedef PACKING union
{
    PACKING struct
    {
        FIELD rsvd_31_00                : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP2_DW18, *PREG_WF_RX_DESCRIPTOR_GROUP2_DW18; // DW18

typedef PACKING union
{
    PACKING struct
    {
        FIELD rsvd_31_00                : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP2_DW19, *PREG_WF_RX_DESCRIPTOR_GROUP2_DW19; // DW19

typedef PACKING union
{
    PACKING struct
    {
        FIELD p_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP3_DW20, *PREG_WF_RX_DESCRIPTOR_GROUP3_DW20; // DW20

typedef PACKING union
{
    PACKING struct
    {
        FIELD p_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP3_DW21, *PREG_WF_RX_DESCRIPTOR_GROUP3_DW21; // DW21

typedef PACKING union
{
    PACKING struct
    {
        FIELD dbw                       :  3; //  2- 0
        FIELD gi                        :  2; //  4- 3
        FIELD dcm                       :  1; //  5- 5
        FIELD num_rx                    :  3; //  8- 6
        FIELD stbc                      :  2; // 10- 9
        FIELD tx_mode                   :  4; // 14-11
        FIELD rsvd_31_15                : 17; // 31-15
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP3_DW22, *PREG_WF_RX_DESCRIPTOR_GROUP3_DW22; // DW22

typedef PACKING union
{
    PACKING struct
    {
        FIELD rcpi                      : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP3_DW23, *PREG_WF_RX_DESCRIPTOR_GROUP3_DW23; // DW23

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW24, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW24; // DW24

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW25, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW25; // DW25

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW26, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW26; // DW26

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW27, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW27; // DW27

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW28, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW28; // DW28

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW29, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW29; // DW29

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW30, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW30; // DW30

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW31, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW31; // DW31

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW32, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW32; // DW32

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW33, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW33; // DW33

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW34, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW34; // DW34

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW35, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW35; // DW35

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW36, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW36; // DW36

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW37, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW37; // DW37

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW38, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW38; // DW38

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW39, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW39; // DW39

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW40, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW40; // DW40

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW41, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW41; // DW41

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW42, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW42; // DW42

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW43, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW43; // DW43

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW44, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW44; // DW44

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW45, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW45; // DW45

typedef PACKING union
{
    PACKING struct
    {
        FIELD rsvd_31_00                : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW46, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW46; // DW46

typedef PACKING union
{
    PACKING struct
    {
        FIELD rsvd_31_00                : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_GROUP5_DW47, *PREG_WF_RX_DESCRIPTOR_GROUP5_DW47; // DW47

// ----------------- WF_RX_DESCRIPTOR Grouping Definitions  -----------------
// ----------------- WF_RX_DESCRIPTOR Register Definition   -----------------
typedef volatile PACKING struct
{
    REG_WF_RX_DESCRIPTOR_DW00                    WF_RX_DESCRIPTOR_DW00                   ; // 0x0000
    REG_WF_RX_DESCRIPTOR_DW01                    WF_RX_DESCRIPTOR_DW01                   ; // 0x0004
    REG_WF_RX_DESCRIPTOR_DW02                    WF_RX_DESCRIPTOR_DW02                   ; // 0x0008
    REG_WF_RX_DESCRIPTOR_DW03                    WF_RX_DESCRIPTOR_DW03                   ; // 0x000c
    REG_WF_RX_DESCRIPTOR_DW04                    WF_RX_DESCRIPTOR_DW04                   ; // 0x0010
    REG_WF_RX_DESCRIPTOR_DW05                    WF_RX_DESCRIPTOR_DW05                   ; // 0x0014
    REG_WF_RX_DESCRIPTOR_PF_DW06                 WF_RX_DESCRIPTOR_PF_DW06                ; // 0x0018
    REG_WF_RX_DESCRIPTOR_PF_DW07                 WF_RX_DESCRIPTOR_PF_DW07                ; // 0x001c
    REG_WF_RX_DESCRIPTOR_GROUP4_DW08             WF_RX_DESCRIPTOR_GROUP4_DW08            ; // 0x0020
    REG_WF_RX_DESCRIPTOR_GROUP4_DW09             WF_RX_DESCRIPTOR_GROUP4_DW09            ; // 0x0024
    REG_WF_RX_DESCRIPTOR_GROUP4_DW10             WF_RX_DESCRIPTOR_GROUP4_DW10            ; // 0x0028
    REG_WF_RX_DESCRIPTOR_GROUP4_DW11             WF_RX_DESCRIPTOR_GROUP4_DW11            ; // 0x002c
    REG_WF_RX_DESCRIPTOR_GROUP1_DW12             WF_RX_DESCRIPTOR_GROUP1_DW12            ; // 0x0030
    REG_WF_RX_DESCRIPTOR_GROUP1_DW13             WF_RX_DESCRIPTOR_GROUP1_DW13            ; // 0x0034
    REG_WF_RX_DESCRIPTOR_GROUP1_DW14             WF_RX_DESCRIPTOR_GROUP1_DW14            ; // 0x0038
    REG_WF_RX_DESCRIPTOR_GROUP1_DW15             WF_RX_DESCRIPTOR_GROUP1_DW15            ; // 0x003c
    REG_WF_RX_DESCRIPTOR_GROUP2_DW16             WF_RX_DESCRIPTOR_GROUP2_DW16            ; // 0x0040
    REG_WF_RX_DESCRIPTOR_GROUP2_DW17             WF_RX_DESCRIPTOR_GROUP2_DW17            ; // 0x0044
    REG_WF_RX_DESCRIPTOR_GROUP2_DW18             WF_RX_DESCRIPTOR_GROUP2_DW18            ; // 0x0048
    REG_WF_RX_DESCRIPTOR_GROUP2_DW19             WF_RX_DESCRIPTOR_GROUP2_DW19            ; // 0x004c
    REG_WF_RX_DESCRIPTOR_GROUP3_DW20             WF_RX_DESCRIPTOR_GROUP3_DW20            ; // 0x0050
    REG_WF_RX_DESCRIPTOR_GROUP3_DW21             WF_RX_DESCRIPTOR_GROUP3_DW21            ; // 0x0054
    REG_WF_RX_DESCRIPTOR_GROUP3_DW22             WF_RX_DESCRIPTOR_GROUP3_DW22            ; // 0x0058
    REG_WF_RX_DESCRIPTOR_GROUP3_DW23             WF_RX_DESCRIPTOR_GROUP3_DW23            ; // 0x005c
    REG_WF_RX_DESCRIPTOR_GROUP5_DW24             WF_RX_DESCRIPTOR_GROUP5_DW24            ; // 0x0060
    REG_WF_RX_DESCRIPTOR_GROUP5_DW25             WF_RX_DESCRIPTOR_GROUP5_DW25            ; // 0x0064
    REG_WF_RX_DESCRIPTOR_GROUP5_DW26             WF_RX_DESCRIPTOR_GROUP5_DW26            ; // 0x0068
    REG_WF_RX_DESCRIPTOR_GROUP5_DW27             WF_RX_DESCRIPTOR_GROUP5_DW27            ; // 0x006c
    REG_WF_RX_DESCRIPTOR_GROUP5_DW28             WF_RX_DESCRIPTOR_GROUP5_DW28            ; // 0x0070
    REG_WF_RX_DESCRIPTOR_GROUP5_DW29             WF_RX_DESCRIPTOR_GROUP5_DW29            ; // 0x0074
    REG_WF_RX_DESCRIPTOR_GROUP5_DW30             WF_RX_DESCRIPTOR_GROUP5_DW30            ; // 0x0078
    REG_WF_RX_DESCRIPTOR_GROUP5_DW31             WF_RX_DESCRIPTOR_GROUP5_DW31            ; // 0x007c
    REG_WF_RX_DESCRIPTOR_GROUP5_DW32             WF_RX_DESCRIPTOR_GROUP5_DW32            ; // 0x0080
    REG_WF_RX_DESCRIPTOR_GROUP5_DW33             WF_RX_DESCRIPTOR_GROUP5_DW33            ; // 0x0084
    REG_WF_RX_DESCRIPTOR_GROUP5_DW34             WF_RX_DESCRIPTOR_GROUP5_DW34            ; // 0x0088
    REG_WF_RX_DESCRIPTOR_GROUP5_DW35             WF_RX_DESCRIPTOR_GROUP5_DW35            ; // 0x008c
    REG_WF_RX_DESCRIPTOR_GROUP5_DW36             WF_RX_DESCRIPTOR_GROUP5_DW36            ; // 0x0090
    REG_WF_RX_DESCRIPTOR_GROUP5_DW37             WF_RX_DESCRIPTOR_GROUP5_DW37            ; // 0x0094
    REG_WF_RX_DESCRIPTOR_GROUP5_DW38             WF_RX_DESCRIPTOR_GROUP5_DW38            ; // 0x0098
    REG_WF_RX_DESCRIPTOR_GROUP5_DW39             WF_RX_DESCRIPTOR_GROUP5_DW39            ; // 0x009c
    REG_WF_RX_DESCRIPTOR_GROUP5_DW40             WF_RX_DESCRIPTOR_GROUP5_DW40            ; // 0x00a0
    REG_WF_RX_DESCRIPTOR_GROUP5_DW41             WF_RX_DESCRIPTOR_GROUP5_DW41            ; // 0x00a4
    REG_WF_RX_DESCRIPTOR_GROUP5_DW42             WF_RX_DESCRIPTOR_GROUP5_DW42            ; // 0x00a8
    REG_WF_RX_DESCRIPTOR_GROUP5_DW43             WF_RX_DESCRIPTOR_GROUP5_DW43            ; // 0x00ac
    REG_WF_RX_DESCRIPTOR_GROUP5_DW44             WF_RX_DESCRIPTOR_GROUP5_DW44            ; // 0x00b0
    REG_WF_RX_DESCRIPTOR_GROUP5_DW45             WF_RX_DESCRIPTOR_GROUP5_DW45            ; // 0x00b4
    REG_WF_RX_DESCRIPTOR_GROUP5_DW46             WF_RX_DESCRIPTOR_GROUP5_DW46            ; // 0x00b8
    REG_WF_RX_DESCRIPTOR_GROUP5_DW47             WF_RX_DESCRIPTOR_GROUP5_DW47            ; // 0x00bc
}WF_RX_DESCRIPTOR_REGS, *PWF_RX_DESCRIPTOR_REGS;
// ----------------- WF_RX_DESCRIPTOR Enum Definitions      -----------------
// ----------------- WF_RX_DESCRIPTOR C Macro Definitions   -----------------
extern PWF_RX_DESCRIPTOR_REGS g_WF_RX_DESCRIPTOR_BASE;

#define WF_RX_DESCRIPTOR_BASE (g_WF_RX_DESCRIPTOR_BASE)
#define WF_RX_DESCRIPTOR_DW00                    INREG32(&WF_RX_DESCRIPTOR_BASE->WF_RX_DESCRIPTOR_DW00                   ) // 0x0000
#define WF_RX_DESCRIPTOR_DW01                    INREG32(&WF_RX_DESCRIPTOR_BASE->WF_RX_DESCRIPTOR_DW01                   ) // 0x0004
#define WF_RX_DESCRIPTOR_DW02                    INREG32(&WF_RX_DESCRIPTOR_BASE->WF_RX_DESCRIPTOR_DW02                   ) // 0x0008
#define WF_RX_DESCRIPTOR_DW03                    INREG32(&WF_RX_DESCRIPTOR_BASE->WF_RX_DESCRIPTOR_DW03                   ) // 0x000c
