#ifndef __WF_UWTBL_REGS_H__
#define __WF_UWTBL_REGS_H__
/*
 * Copyright (c) 2021, MediaTek Inc. All rights reserved.
 *
 * This software/firmware and related documentation ("MediaTek Software") are
 * protected under relevant copyright laws.
 * The information contained herein is confidential and proprietary to
 * MediaTek Inc. and/or its licensors.
 * Except as otherwise provided in the applicable licensing terms with
 * MediaTek Inc. and/or its licensors, any reproduction, modification, use or
 * disclosure of MediaTek Software, and information contained herein, in whole
 * or in part, shall be strictly prohibited.
*/

#ifdef __cplusplus
extern "C" {
#endif // __cplusplus

#ifndef REG_BASE_C_MODULE

#define PACKING
typedef unsigned int FIELD;

typedef PACKING union
{
    PACKING struct
    {
        FIELD peer_mld_address_47_32_   : 16; // 15- 0
        FIELD own_mld_id                :  6; // 21-16
        FIELD rsvd_31_22                : 10; // 31-22
    } Bits;
    UINT32 Raw;
} REG_WF_UWTBL_MLO_INFO_DW00, *PREG_WF_UWTBL_MLO_INFO_DW00; // DW0

typedef PACKING union
{
    PACKING struct
    {
        FIELD peer_mld_address_31_0_    : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_UWTBL_MLO_INFO_DW01, *PREG_WF_UWTBL_MLO_INFO_DW01; // DW1

typedef PACKING union
{
    PACKING struct
    {
        FIELD pn_31_0_                  : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_UWTBL_PN_SN_DW02, *PREG_WF_UWTBL_PN_SN_DW02; // DW2

typedef PACKING union
{
    PACKING struct
    {
        FIELD pn_47_32_                 : 16; // 15- 0
        FIELD com_sn                    : 12; // 27-16
        FIELD rsvd_31_28                :  4; // 31-28
    } Bits;
    UINT32 Raw;
} REG_WF_UWTBL_PN_SN_DW03, *PREG_WF_UWTBL_PN_SN_DW03; // DW3

typedef PACKING union
{
    PACKING struct
    {
        FIELD tid0_sn                   : 12; // 11- 0
        FIELD tid1_sn                   : 12; // 23-12
        FIELD tid2_sn_7_0_              :  8; // 31-24
    } Bits;
    PACKING struct
    {
        FIELD rx_bipn_31_0_             : 32; // 31- 0
    } Bits1;
    UINT32 Raw;
} REG_WF_UWTBL_PN_SN_DW04, *PREG_WF_UWTBL_PN_SN_DW04; // DW4

typedef PACKING union
{
    PACKING struct
    {
        FIELD tid2_sn_11_8_             :  4; //  3- 0
        FIELD tid3_sn                   : 12; // 15- 4
        FIELD tid4_sn                   : 12; // 27-16
        FIELD tid5_sn_3_0_              :  4; // 31-28
    } Bits;
    PACKING struct
    {
        FIELD rx_bipn_47_32_            : 16; // 15- 0
        FIELD rsvd_31_16                : 16; // 31-16
    } Bits1;
    UINT32 Raw;
} REG_WF_UWTBL_PN_SN_DW05, *PREG_WF_UWTBL_PN_SN_DW05; // DW5

typedef PACKING union
{
    PACKING struct
    {
        FIELD tid5_sn_11_4_             :  8; //  7- 0
        FIELD tid6_sn                   : 12; // 19- 8
        FIELD tid7_sn                   : 12; // 31-20
    } Bits;
    PACKING struct
    {
        FIELD key_loc2                  : 13; // 12- 0
        FIELD rsvd_31_13                : 19; // 31-13
    } Bits1;
    UINT32 Raw;
} REG_WF_UWTBL_PN_SN_DW06, *PREG_WF_UWTBL_PN_SN_DW06; // DW6

typedef PACKING union
{
    PACKING struct
    {
        FIELD key_loc0                  : 13; // 12- 0
        FIELD rsvd_15_13                :  3; // 15-13
        FIELD key_loc1                  : 13; // 28-16
        FIELD rsvd_31_29                :  3; // 31-29
    } Bits;
    UINT32 Raw;
} REG_WF_UWTBL_KEY_INFO_DW07, *PREG_WF_UWTBL_KEY_INFO_DW07; // DW7

typedef PACKING union
{
    PACKING struct
    {
        FIELD amsdu_cfg                 : 12; // 11- 0
        FIELD rsvd_24_12                : 13; // 24-12
        FIELD wmm_q                     :  2; // 26-25
        FIELD qos                       :  1; // 27-27
        FIELD ht                        :  1; // 28-28
        FIELD hdrt_mode                 :  1; // 29-29
        FIELD bypass_rro                :  1; // 30-30
        FIELD rsvd_31_31                :  1; // 31-31
    } Bits;
    UINT32 Raw;
} REG_WF_UWTBL_MSDU_INFO_DW08, *PREG_WF_UWTBL_MSDU_INFO_DW08; // DW8

typedef PACKING union
{
    PACKING struct
    {
        FIELD related_idx0              : 12; // 11- 0
        FIELD related_band0             :  2; // 13-12
        FIELD primary_mld_band          :  2; // 15-14
        FIELD related_idx1              : 12; // 27-16
        FIELD related_band1             :  2; // 29-28
        FIELD secondary_mld_band        :  2; // 31-30
    } Bits;
    UINT32 Raw;
} REG_WF_UWTBL_MLO_INFO_DW09, *PREG_WF_UWTBL_MLO_INFO_DW09; // DW9

typedef PACKING union
{
    PACKING struct
    {
        FIELD msdu_rx_count             : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_UWTBL_MSDU_COUNTER_DW10, *PREG_WF_UWTBL_MSDU_COUNTER_DW10; // DW10

typedef PACKING union
{
    PACKING struct
    {
        FIELD msdu_tx_count             : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_UWTBL_MSDU_COUNTER_DW11, *PREG_WF_UWTBL_MSDU_COUNTER_DW11; // DW11

typedef PACKING union
{
    PACKING struct
    {
        FIELD msdu_tx_retry_cont        : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_UWTBL_MSDU_COUNTER_DW12, *PREG_WF_UWTBL_MSDU_COUNTER_DW12; // DW12

typedef PACKING union
{
    PACKING struct
    {
        FIELD msdu_tx_drop_count        : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_UWTBL_MSDU_COUNTER_DW13, *PREG_WF_UWTBL_MSDU_COUNTER_DW13; // DW13

typedef PACKING union
{
    PACKING struct
    {
        FIELD msdu_tx_had_retried_count : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_UWTBL_MSDU_COUNTER_DW14, *PREG_WF_UWTBL_MSDU_COUNTER_DW14; // DW14

typedef PACKING union
{
    PACKING struct
    {
        FIELD msdu_tx_retry_large_than_one_count : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_UWTBL_MSDU_COUNTER_DW15, *PREG_WF_UWTBL_MSDU_COUNTER_DW15; // DW15

typedef volatile PACKING struct
{
    REG_WF_UWTBL_MLO_INFO_DW00                   WF_UWTBL_MLO_INFO_DW00                  ; // 0x0000
    REG_WF_UWTBL_MLO_INFO_DW01                   WF_UWTBL_MLO_INFO_DW01                  ; // 0x0004
    REG_WF_UWTBL_PN_SN_DW02                      WF_UWTBL_PN_SN_DW02                     ; // 0x0008
    REG_WF_UWTBL_PN_SN_DW03                      WF_UWTBL_PN_SN_DW03                     ; // 0x000c
    REG_WF_UWTBL_PN_SN_DW04                      WF_UWTBL_PN_SN_DW04                     ; // 0x0010
    REG_WF_UWTBL_PN_SN_DW05                      WF_UWTBL_PN_SN_DW05                     ; // 0x0014
    REG_WF_UWTBL_PN_SN_DW06                      WF_UWTBL_PN_SN_DW06                     ; // 0x0018
    REG_WF_UWTBL_KEY_INFO_DW07                   WF_UWTBL_KEY_INFO_DW07                  ; // 0x001c
    REG_WF_UWTBL_MSDU_INFO_DW08                  WF_UWTBL_MSDU_INFO_DW08                 ; // 0x0020
    REG_WF_UWTBL_MLO_INFO_DW09                   WF_UWTBL_MLO_INFO_DW09                  ; // 0x0024
    REG_WF_UWTBL_MSDU_COUNTER_DW10               WF_UWTBL_MSDU_COUNTER_DW10              ; // 0x0028
    REG_WF_UWTBL_MSDU_COUNTER_DW11               WF_UWTBL_MSDU_COUNTER_DW11              ; // 0x002c
    REG_WF_UWTBL_MSDU_COUNTER_DW12               WF_UWTBL_MSDU_COUNTER_DW12              ; // 0x0030
    REG_WF_UWTBL_MSDU_COUNTER_DW13               WF_UWTBL_MSDU_COUNTER_DW13              ; // 0x0034
    REG_WF_UWTBL_MSDU_COUNTER_DW14               WF_UWTBL_MSDU_COUNTER_DW14              ; // 0x0038
    REG_WF_UWTBL_MSDU_COUNTER_DW15               WF_UWTBL_MSDU_COUNTER_DW15              ; // 0x003c
}WF_UWTBL_REGS, *PWF_UWTBL_REGS;
extern PWF_UWTBL_REGS g_WF_UWTBL_BASE;

#define WF_UWTBL_BASE (g_WF_UWTBL_BASE)
#define WF_UWTBL_MLO_INFO_DW00                   INREG32(&WF_UWTBL_BASE->WF_UWTBL_MLO_INFO_DW00                  ) // 0x0000
#define WF_UWTBL_MLO_INFO_DW01                   INREG32(&WF_UWTBL_BASE->WF_UWTBL_MLO_INFO_DW01                  ) // 0x0004
#define WF_UWTBL_PN_SN_DW02                      INREG32(&WF_UWTBL_BASE->WF_UWTBL_PN_SN_DW02                     ) // 0x0008
#define WF_UWTBL_PN_SN_DW03                      INREG32(&WF_UWTBL_BASE->WF_UWTBL_PN_SN_DW03                     ) // 0x000c
#define WF_UWTBL_PN_SN_DW04                      INREG32(&WF_UWTBL_BASE->WF_UWTBL_PN_SN_DW04                     ) // 0x0010
#define WF_UWTBL_PN_SN_DW05                      INREG32(&WF_UWTBL_BASE->WF_UWTBL_PN_SN_DW05                     ) // 0x0014
