#ifndef __WF_TX_DESCRIPTOR_REGS_H__
#define __WF_TX_DESCRIPTOR_REGS_H__

#ifdef __cplusplus
extern "C" {
#endif // __cplusplus

#ifndef REG_BASE_C_MODULE

#define PACKING
typedef unsigned int FIELD;

typedef PACKING union
{
    PACKING struct
    {
        FIELD tx_byte_count             : 16; // 15- 0
        FIELD ether_type_offset         :  7; // 22-16
        FIELD pkt_ft                    :  2; // 24-23
        FIELD q_idx                     :  7; // 31-25
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE1_DW00, *PREG_WF_TX_DESCRIPTOR_PAGE1_DW00; // DW0

typedef PACKING union
{
    PACKING struct
    {
        FIELD mld_id                    : 12; // 11- 0
        FIELD tgid                      :  2; // 13-12
        FIELD hf                        :  2; // 15-14
        FIELD header_length             :  5; // 20-16
        FIELD tid_mgmt_type             :  4; // 24-21
        FIELD om                        :  6; // 30-25
        FIELD fr                        :  1; // 31-31
    } Bits;
    PACKING struct
    {
        FIELD mld_id                    : 12; // 11- 0
        FIELD tgid                      :  2; // 13-12
        FIELD hf                        :  2; // 15-14
        FIELD rsvd_16_16                :  1; // 16-16
        FIELD eosp                      :  1; // 17-17
        FIELD ams                       :  1; // 18-18
        FIELD rsvd_20_19                :  2; // 20-19
        FIELD tid_mgmt_type             :  4; // 24-21
        FIELD om                        :  6; // 30-25
        FIELD fr                        :  1; // 31-31
    } Bits1;
    PACKING struct
    {
        FIELD mld_id                    : 12; // 11- 0
        FIELD tgid                      :  2; // 13-12
        FIELD hf                        :  2; // 15-14
        FIELD mrd                       :  1; // 16-16
        FIELD eosp                      :  1; // 17-17
        FIELD rmvl                      :  1; // 18-18
        FIELD vlan                      :  1; // 19-19
        FIELD etyp                      :  1; // 20-20
        FIELD tid_mgmt_type             :  4; // 24-21
        FIELD om                        :  6; // 30-25
        FIELD fr                        :  1; // 31-31
    } Bits2;
    PACKING struct
    {
        FIELD mld_id                    : 12; // 11- 0
        FIELD tgid                      :  2; // 13-12
        FIELD hf                        :  2; // 15-14
        FIELD rsvd_20_16                :  5; // 20-16
        FIELD tid_mgmt_type             :  4; // 24-21
        FIELD om                        :  6; // 30-25
        FIELD fr                        :  1; // 31-31
    } Bits3;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE1_DW01, *PREG_WF_TX_DESCRIPTOR_PAGE1_DW01; // DW1

typedef PACKING union
{
    PACKING struct
    {
        FIELD subtype                   :  4; //  3- 0
        FIELD ftype                     :  2; //  5- 4
        FIELD bf_type                   :  3; //  8- 6
        FIELD om_map                    :  1; //  9- 9
        FIELD header_padding            :  2; // 11-10
        FIELD du                        :  1; // 12-12
        FIELD he                        :  1; // 13-13
        FIELD frag                      :  2; // 15-14
        FIELD remaining_tx_time         : 10; // 25-16
        FIELD power_offset              :  6; // 31-26
    } Bits;
    PACKING struct
    {
        FIELD rsvd_31_00                : 32; // 31- 0
    } Bits1;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE1_DW02, *PREG_WF_TX_DESCRIPTOR_PAGE1_DW02; // DW2

typedef PACKING union
{
    PACKING struct
    {
        FIELD na                        :  1; //  0- 0
        FIELD pf                        :  1; //  1- 1
        FIELD emrd                      :  1; //  2- 2
        FIELD eeosp                     :  1; //  3- 3
        FIELD bm                        :  1; //  4- 4
        FIELD hw_amsdu_cap              :  1; //  5- 5
        FIELD tx_count                  :  5; // 10- 6
        FIELD remaining_tx_count        :  5; // 15-11
        FIELD sn                        : 12; // 27-16
        FIELD ba_dis                    :  1; // 28-28
        FIELD pm                        :  1; // 29-29
        FIELD pn_vld                    :  1; // 30-30
        FIELD sn_vld                    :  1; // 31-31
    } Bits;
    PACKING struct
    {
        FIELD rsvd_31_00                : 32; // 31- 0
    } Bits1;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE1_DW03, *PREG_WF_TX_DESCRIPTOR_PAGE1_DW03; // DW3

typedef PACKING union
{
    PACKING struct
    {
        FIELD pn_31_0_                  : 32; // 31- 0
    } Bits;
    PACKING struct
    {
        FIELD rsvd_31_00                : 32; // 31- 0
    } Bits1;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE1_DW04, *PREG_WF_TX_DESCRIPTOR_PAGE1_DW04; // DW4

typedef PACKING union
{
    PACKING struct
    {
        FIELD pid                       :  8; //  7- 0
        FIELD txsfm                     :  1; //  8- 8
        FIELD txs2m                     :  1; //  9- 9
        FIELD txs2h                     :  1; // 10-10
        FIELD ocp                       :  1; // 11-11
        FIELD fbcz                      :  1; // 12-12
        FIELD bypass_rbb                :  1; // 13-13
        FIELD bypass_tbb                :  1; // 14-14
        FIELD fl                        :  1; // 15-15
        FIELD pn_47_32_                 : 16; // 31-16
    } Bits;
    PACKING struct
    {
        FIELD rsvd_31_00                : 32; // 31- 0
    } Bits1;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE1_DW05, *PREG_WF_TX_DESCRIPTOR_PAGE1_DW05; // DW5

typedef PACKING union
{
    PACKING struct
    {
        FIELD mld                       :  1; //  0- 0
        FIELD amsdu_cap_utxb            :  1; //  1- 1
        FIELD das                       :  1; //  2- 2
        FIELD dis_mat                   :  1; //  3- 3
        FIELD rsvd_09_04                :  6; //  9- 4
        FIELD timestamp_offset_idx      :  5; // 14-10
        FIELD timestamp_offset_en       :  1; // 15-15
        FIELD fixed_rate_idx            :  6; // 21-16
        FIELD bw                        :  4; // 25-22
        FIELD rsvd_27_26                :  2; // 27-26
        FIELD vta                       :  1; // 28-28
        FIELD rsvd_29_29                :  1; // 29-29
        FIELD src                       :  2; // 31-30
    } Bits;
    PACKING struct
    {
        FIELD mld                       :  1; //  0- 0
        FIELD amsdu_cap_utxb            :  1; //  1- 1
        FIELD das                       :  1; //  2- 2
        FIELD dis_mat                   :  1; //  3- 3
        FIELD rsvd_09_04                :  6; //  9- 4
        FIELD msdu_count                :  6; // 15-10
        FIELD fixed_rate_idx            :  6; // 21-16
        FIELD bw                        :  4; // 25-22
        FIELD rsvd_27_26                :  2; // 27-26
        FIELD vta                       :  1; // 28-28
        FIELD rsvd_29_29                :  1; // 29-29
        FIELD src                       :  2; // 31-30
    } Bits1;
    PACKING struct
    {
        FIELD rsvd_31_00                : 32; // 31- 0
    } Bits2;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE1_DW06, *PREG_WF_TX_DESCRIPTOR_PAGE1_DW06; // DW6

typedef PACKING union
{
    PACKING struct
    {
        FIELD sw_tx_time                : 10; //  9- 0
        FIELD rsvd_11_10                :  2; // 11-10
        FIELD ici                       :  1; // 12-12
        FIELD rts                       :  1; // 13-13
        FIELD dis_dly_tx                :  1; // 14-14
        FIELD ut                        :  1; // 15-15
        FIELD rsvd_21_16                :  6; // 21-16
        FIELD ctxd_cnt                  :  4; // 25-22
        FIELD ctxd                      :  1; // 26-26
        FIELD hm                        :  1; // 27-27
        FIELD rsvd_28_28                :  1; // 28-28
        FIELD ip                        :  1; // 29-29
        FIELD txd_len                   :  2; // 31-30
    } Bits;
    PACKING struct
    {
        FIELD rsvd_31_00                : 32; // 31- 0
    } Bits1;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE1_DW07, *PREG_WF_TX_DESCRIPTOR_PAGE1_DW07; // DW7

typedef PACKING union
{
    PACKING struct
    {
        FIELD token0                    : 16; // 15- 0
        FIELD token1                    : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE1_DW08, *PREG_WF_TX_DESCRIPTOR_PAGE1_DW08; // DW8

typedef PACKING union
{
    PACKING struct
    {
        FIELD token2                    : 16; // 15- 0
        FIELD token3                    : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE1_DW09, *PREG_WF_TX_DESCRIPTOR_PAGE1_DW09; // DW9

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp0                      : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE1_DW10, *PREG_WF_TX_DESCRIPTOR_PAGE1_DW10; // DW10

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp0                      : 16; // 15- 0
        FIELD txp1                      : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE1_DW11, *PREG_WF_TX_DESCRIPTOR_PAGE1_DW11; // DW11

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp1                      : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE1_DW12, *PREG_WF_TX_DESCRIPTOR_PAGE1_DW12; // DW12

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp2                      : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE1_DW13, *PREG_WF_TX_DESCRIPTOR_PAGE1_DW13; // DW13

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp2                      : 16; // 15- 0
        FIELD txp3                      : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE1_DW14, *PREG_WF_TX_DESCRIPTOR_PAGE1_DW14; // DW14

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp3                      : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE1_DW15, *PREG_WF_TX_DESCRIPTOR_PAGE1_DW15; // DW15

typedef PACKING union
{
    PACKING struct
    {
        FIELD token4                    : 16; // 15- 0
        FIELD token5                    : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE2_DW16, *PREG_WF_TX_DESCRIPTOR_PAGE2_DW16; // DW16

typedef PACKING union
{
    PACKING struct
    {
        FIELD token6                    : 16; // 15- 0
        FIELD token7                    : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE2_DW17, *PREG_WF_TX_DESCRIPTOR_PAGE2_DW17; // DW17

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp4                      : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE2_DW18, *PREG_WF_TX_DESCRIPTOR_PAGE2_DW18; // DW18

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp4                      : 16; // 15- 0
        FIELD txp5                      : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE2_DW19, *PREG_WF_TX_DESCRIPTOR_PAGE2_DW19; // DW19

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp5                      : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE2_DW20, *PREG_WF_TX_DESCRIPTOR_PAGE2_DW20; // DW20

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp6                      : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE2_DW21, *PREG_WF_TX_DESCRIPTOR_PAGE2_DW21; // DW21

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp6                      : 16; // 15- 0
        FIELD txp7                      : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE2_DW22, *PREG_WF_TX_DESCRIPTOR_PAGE2_DW22; // DW22

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp7                      : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE2_DW23, *PREG_WF_TX_DESCRIPTOR_PAGE2_DW23; // DW23

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp8                      : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE2_DW24, *PREG_WF_TX_DESCRIPTOR_PAGE2_DW24; // DW24

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp8                      : 16; // 15- 0
        FIELD txp9                      : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE2_DW25, *PREG_WF_TX_DESCRIPTOR_PAGE2_DW25; // DW25

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp9                      : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE2_DW26, *PREG_WF_TX_DESCRIPTOR_PAGE2_DW26; // DW26

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp10                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE2_DW27, *PREG_WF_TX_DESCRIPTOR_PAGE2_DW27; // DW27

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp10                     : 16; // 15- 0
        FIELD txp11                     : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE2_DW28, *PREG_WF_TX_DESCRIPTOR_PAGE2_DW28; // DW28

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp11                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE2_DW29, *PREG_WF_TX_DESCRIPTOR_PAGE2_DW29; // DW29

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp12                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE2_DW30, *PREG_WF_TX_DESCRIPTOR_PAGE2_DW30; // DW30

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp12                     : 16; // 15- 0
        FIELD txp13_len                 : 12; // 27-16
        FIELD txp13_addr_33_32_         :  2; // 29-28
        FIELD txp13_src                 :  1; // 30-30
        FIELD txp13_ml                  :  1; // 31-31
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE2_DW31, *PREG_WF_TX_DESCRIPTOR_PAGE2_DW31; // DW31

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp13_addr_31_0_          : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE3_DW32, *PREG_WF_TX_DESCRIPTOR_PAGE3_DW32; // DW32

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp14                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE3_DW33, *PREG_WF_TX_DESCRIPTOR_PAGE3_DW33; // DW33

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp14                     : 16; // 15- 0
        FIELD txp15                     : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE3_DW34, *PREG_WF_TX_DESCRIPTOR_PAGE3_DW34; // DW34

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp15                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE3_DW35, *PREG_WF_TX_DESCRIPTOR_PAGE3_DW35; // DW35

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp16                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE3_DW36, *PREG_WF_TX_DESCRIPTOR_PAGE3_DW36; // DW36

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp16                     : 16; // 15- 0
        FIELD txp17                     : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE3_DW37, *PREG_WF_TX_DESCRIPTOR_PAGE3_DW37; // DW37

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp17                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE3_DW38, *PREG_WF_TX_DESCRIPTOR_PAGE3_DW38; // DW38

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp18                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE3_DW39, *PREG_WF_TX_DESCRIPTOR_PAGE3_DW39; // DW39

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp18                     : 16; // 15- 0
        FIELD txp19                     : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE3_DW40, *PREG_WF_TX_DESCRIPTOR_PAGE3_DW40; // DW40

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp19                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE3_DW41, *PREG_WF_TX_DESCRIPTOR_PAGE3_DW41; // DW41

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp20                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE3_DW42, *PREG_WF_TX_DESCRIPTOR_PAGE3_DW42; // DW42

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp20                     : 16; // 15- 0
        FIELD txp21                     : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE3_DW43, *PREG_WF_TX_DESCRIPTOR_PAGE3_DW43; // DW43

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp21                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE3_DW44, *PREG_WF_TX_DESCRIPTOR_PAGE3_DW44; // DW44

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp22                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE3_DW45, *PREG_WF_TX_DESCRIPTOR_PAGE3_DW45; // DW45

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp22                     : 16; // 15- 0
        FIELD txp23                     : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE3_DW46, *PREG_WF_TX_DESCRIPTOR_PAGE3_DW46; // DW46

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp23                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE3_DW47, *PREG_WF_TX_DESCRIPTOR_PAGE3_DW47; // DW47

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp24                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE4_DW48, *PREG_WF_TX_DESCRIPTOR_PAGE4_DW48; // DW48

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp24                     : 16; // 15- 0
        FIELD txp25                     : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE4_DW49, *PREG_WF_TX_DESCRIPTOR_PAGE4_DW49; // DW49

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp25                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE4_DW50, *PREG_WF_TX_DESCRIPTOR_PAGE4_DW50; // DW50

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp26                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE4_DW51, *PREG_WF_TX_DESCRIPTOR_PAGE4_DW51; // DW51

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp26                     : 16; // 15- 0
        FIELD txp27                     : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE4_DW52, *PREG_WF_TX_DESCRIPTOR_PAGE4_DW52; // DW52

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp27                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE4_DW53, *PREG_WF_TX_DESCRIPTOR_PAGE4_DW53; // DW53

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp28                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE4_DW54, *PREG_WF_TX_DESCRIPTOR_PAGE4_DW54; // DW54

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp28                     : 16; // 15- 0
        FIELD txp29                     : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE4_DW55, *PREG_WF_TX_DESCRIPTOR_PAGE4_DW55; // DW55

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp29                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE4_DW56, *PREG_WF_TX_DESCRIPTOR_PAGE4_DW56; // DW56

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp30                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE4_DW57, *PREG_WF_TX_DESCRIPTOR_PAGE4_DW57; // DW57

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp30                     : 16; // 15- 0
        FIELD txp31                     : 16; // 31-16
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE4_DW58, *PREG_WF_TX_DESCRIPTOR_PAGE4_DW58; // DW58

typedef PACKING union
{
    PACKING struct
    {
        FIELD txp31                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_TX_DESCRIPTOR_PAGE4_DW59, *PREG_WF_TX_DESCRIPTOR_PAGE4_DW59; // DW59

typedef volatile PACKING struct
{
    REG_WF_TX_DESCRIPTOR_PAGE1_DW00              WF_TX_DESCRIPTOR_PAGE1_DW00             ; // 0x0000
    REG_WF_TX_DESCRIPTOR_PAGE1_DW01              WF_TX_DESCRIPTOR_PAGE1_DW01             ; // 0x0004
    REG_WF_TX_DESCRIPTOR_PAGE1_DW02              WF_TX_DESCRIPTOR_PAGE1_DW02             ; // 0x0008
    REG_WF_TX_DESCRIPTOR_PAGE1_DW03              WF_TX_DESCRIPTOR_PAGE1_DW03             ; // 0x000c
    REG_WF_TX_DESCRIPTOR_PAGE1_DW04              WF_TX_DESCRIPTOR_PAGE1_DW04             ; // 0x0010
    REG_WF_TX_DESCRIPTOR_PAGE1_DW05              WF_TX_DESCRIPTOR_PAGE1_DW05             ; // 0x0014
    REG_WF_TX_DESCRIPTOR_PAGE1_DW06              WF_TX_DESCRIPTOR_PAGE1_DW06             ; // 0x0018
    REG_WF_TX_DESCRIPTOR_PAGE1_DW07              WF_TX_DESCRIPTOR_PAGE1_DW07             ; // 0x001c
    REG_WF_TX_DESCRIPTOR_PAGE1_DW08              WF_TX_DESCRIPTOR_PAGE1_DW08             ; // 0x0020
    REG_WF_TX_DESCRIPTOR_PAGE1_DW09              WF_TX_DESCRIPTOR_PAGE1_DW09             ; // 0x0024
    REG_WF_TX_DESCRIPTOR_PAGE1_DW10              WF_TX_DESCRIPTOR_PAGE1_DW10             ; // 0x0028
    REG_WF_TX_DESCRIPTOR_PAGE1_DW11              WF_TX_DESCRIPTOR_PAGE1_DW11             ; // 0x002c
    REG_WF_TX_DESCRIPTOR_PAGE1_DW12              WF_TX_DESCRIPTOR_PAGE1_DW12             ; // 0x0030
    REG_WF_TX_DESCRIPTOR_PAGE1_DW13              WF_TX_DESCRIPTOR_PAGE1_DW13             ; // 0x0034
    REG_WF_TX_DESCRIPTOR_PAGE1_DW14              WF_TX_DESCRIPTOR_PAGE1_DW14             ; // 0x0038
    REG_WF_TX_DESCRIPTOR_PAGE1_DW15              WF_TX_DESCRIPTOR_PAGE1_DW15             ; // 0x003c
    REG_WF_TX_DESCRIPTOR_PAGE2_DW16              WF_TX_DESCRIPTOR_PAGE2_DW16             ; // 0x0040
    REG_WF_TX_DESCRIPTOR_PAGE2_DW17              WF_TX_DESCRIPTOR_PAGE2_DW17             ; // 0x0044
    REG_WF_TX_DESCRIPTOR_PAGE2_DW18              WF_TX_DESCRIPTOR_PAGE2_DW18             ; // 0x0048
    REG_WF_TX_DESCRIPTOR_PAGE2_DW19              WF_TX_DESCRIPTOR_PAGE2_DW19             ; // 0x004c
    REG_WF_TX_DESCRIPTOR_PAGE2_DW20              WF_TX_DESCRIPTOR_PAGE2_DW20             ; // 0x0050
    REG_WF_TX_DESCRIPTOR_PAGE2_DW21              WF_TX_DESCRIPTOR_PAGE2_DW21             ; // 0x0054
    REG_WF_TX_DESCRIPTOR_PAGE2_DW22              WF_TX_DESCRIPTOR_PAGE2_DW22             ; // 0x0058
    REG_WF_TX_DESCRIPTOR_PAGE2_DW23              WF_TX_DESCRIPTOR_PAGE2_DW23             ; // 0x005c
    REG_WF_TX_DESCRIPTOR_PAGE2_DW24              WF_TX_DESCRIPTOR_PAGE2_DW24             ; // 0x0060
    REG_WF_TX_DESCRIPTOR_PAGE2_DW25              WF_TX_DESCRIPTOR_PAGE2_DW25             ; // 0x0064
    REG_WF_TX_DESCRIPTOR_PAGE2_DW26              WF_TX_DESCRIPTOR_PAGE2_DW26             ; // 0x0068
    REG_WF_TX_DESCRIPTOR_PAGE2_DW27              WF_TX_DESCRIPTOR_PAGE2_DW27             ; // 0x006c
    REG_WF_TX_DESCRIPTOR_PAGE2_DW28              WF_TX_DESCRIPTOR_PAGE2_DW28             ; // 0x0070
    REG_WF_TX_DESCRIPTOR_PAGE2_DW29              WF_TX_DESCRIPTOR_PAGE2_DW29             ; // 0x0074
    REG_WF_TX_DESCRIPTOR_PAGE2_DW30              WF_TX_DESCRIPTOR_PAGE2_DW30             ; // 0x0078
    REG_WF_TX_DESCRIPTOR_PAGE2_DW31              WF_TX_DESCRIPTOR_PAGE2_DW31             ; // 0x007c
    REG_WF_TX_DESCRIPTOR_PAGE3_DW32              WF_TX_DESCRIPTOR_PAGE3_DW32             ; // 0x0080
    REG_WF_TX_DESCRIPTOR_PAGE3_DW33              WF_TX_DESCRIPTOR_PAGE3_DW33             ; // 0x0084
    REG_WF_TX_DESCRIPTOR_PAGE3_DW34              WF_TX_DESCRIPTOR_PAGE3_DW34             ; // 0x0088
    REG_WF_TX_DESCRIPTOR_PAGE3_DW35              WF_TX_DESCRIPTOR_PAGE3_DW35             ; // 0x008c
    REG_WF_TX_DESCRIPTOR_PAGE3_DW36              WF_TX_DESCRIPTOR_PAGE3_DW36             ; // 0x0090
    REG_WF_TX_DESCRIPTOR_PAGE3_DW37              WF_TX_DESCRIPTOR_PAGE3_DW37             ; // 0x0094
    REG_WF_TX_DESCRIPTOR_PAGE3_DW38              WF_TX_DESCRIPTOR_PAGE3_DW38             ; // 0x0098
    REG_WF_TX_DESCRIPTOR_PAGE3_DW39              WF_TX_DESCRIPTOR_PAGE3_DW39             ; // 0x009c
    REG_WF_TX_DESCRIPTOR_PAGE3_DW40              WF_TX_DESCRIPTOR_PAGE3_DW40             ; // 0x00a0
    REG_WF_TX_DESCRIPTOR_PAGE3_DW41              WF_TX_DESCRIPTOR_PAGE3_DW41             ; // 0x00a4
    REG_WF_TX_DESCRIPTOR_PAGE3_DW42              WF_TX_DESCRIPTOR_PAGE3_DW42             ; // 0x00a8
    REG_WF_TX_DESCRIPTOR_PAGE3_DW43              WF_TX_DESCRIPTOR_PAGE3_DW43             ; // 0x00ac
    REG_WF_TX_DESCRIPTOR_PAGE3_DW44              WF_TX_DESCRIPTOR_PAGE3_DW44             ; // 0x00b0
    REG_WF_TX_DESCRIPTOR_PAGE3_DW45              WF_TX_DESCRIPTOR_PAGE3_DW45             ; // 0x00b4
    REG_WF_TX_DESCRIPTOR_PAGE3_DW46              WF_TX_DESCRIPTOR_PAGE3_DW46             ; // 0x00b8
    REG_WF_TX_DESCRIPTOR_PAGE3_DW47              WF_TX_DESCRIPTOR_PAGE3_DW47             ; // 0x00bc
    REG_WF_TX_DESCRIPTOR_PAGE4_DW48              WF_TX_DESCRIPTOR_PAGE4_DW48             ; // 0x00c0
    REG_WF_TX_DESCRIPTOR_PAGE4_DW49              WF_TX_DESCRIPTOR_PAGE4_DW49             ; // 0x00c4
    REG_WF_TX_DESCRIPTOR_PAGE4_DW50              WF_TX_DESCRIPTOR_PAGE4_DW50             ; // 0x00c8
    REG_WF_TX_DESCRIPTOR_PAGE4_DW51              WF_TX_DESCRIPTOR_PAGE4_DW51             ; // 0x00cc
    REG_WF_TX_DESCRIPTOR_PAGE4_DW52              WF_TX_DESCRIPTOR_PAGE4_DW52             ; // 0x00d0
    REG_WF_TX_DESCRIPTOR_PAGE4_DW53              WF_TX_DESCRIPTOR_PAGE4_DW53             ; // 0x00d4
    REG_WF_TX_DESCRIPTOR_PAGE4_DW54              WF_TX_DESCRIPTOR_PAGE4_DW54             ; // 0x00d8
    REG_WF_TX_DESCRIPTOR_PAGE4_DW55              WF_TX_DESCRIPTOR_PAGE4_DW55             ; // 0x00dc
    REG_WF_TX_DESCRIPTOR_PAGE4_DW56              WF_TX_DESCRIPTOR_PAGE4_DW56             ; // 0x00e0
    REG_WF_TX_DESCRIPTOR_PAGE4_DW57              WF_TX_DESCRIPTOR_PAGE4_DW57             ; // 0x00e4
    REG_WF_TX_DESCRIPTOR_PAGE4_DW58              WF_TX_DESCRIPTOR_PAGE4_DW58             ; // 0x00e8
    REG_WF_TX_DESCRIPTOR_PAGE4_DW59              WF_TX_DESCRIPTOR_PAGE4_DW59             ; // 0x00ec
} WF_TX_DESCRIPTOR_REGS, *PWF_TX_DESCRIPTOR_REGS;
extern PWF_TX_DESCRIPTOR_REGS g_WF_TX_DESCRIPTOR_BASE;

#define WF_TX_DESCRIPTOR_BASE (g_WF_TX_DESCRIPTOR_BASE)
#define WF_TX_DESCRIPTOR_PAGE1_DW00              INREG32(&WF_TX_DESCRIPTOR_BASE->WF_TX_DESCRIPTOR_PAGE1_DW00             ) // 0x0000
#define WF_TX_DESCRIPTOR_PAGE1_DW01              INREG32(&WF_TX_DESCRIPTOR_BASE->WF_TX_DESCRIPTOR_PAGE1_DW01             ) // 0x0004
#define WF_TX_DESCRIPTOR_PAGE1_DW02              INREG32(&WF_TX_DESCRIPTOR_BASE->WF_TX_DESCRIPTOR_PAGE1_DW02             ) // 0x0008
#define WF_TX_DESCRIPTOR_PAGE1_DW03              INREG32(&WF_TX_DESCRIPTOR_BASE->WF_TX_DESCRIPTOR_PAGE1_DW03             ) // 0x000c
#define WF_TX_DESCRIPTOR_PAGE1_DW04              INREG32(&WF_TX_DESCRIPTOR_BASE->WF_TX_DESCRIPTOR_PAGE1_DW04             ) // 0x0010
