// generate by structure_parser.py at 2022-07-05 12:31:09
#ifndef __WF_RX_DESCRIPTOR_G0_REGS_H__
#define __WF_RX_DESCRIPTOR_G0_REGS_H__
/*
 * Copyright (c) 2022, MediaTek Inc. All rights reserved.
 *
 * This software/firmware and related documentation ("MediaTek Software") are
 * protected under relevant copyright laws.
 * The information contained herein is confidential and proprietary to
 * MediaTek Inc. and/or its licensors.
 * Except as otherwise provided in the applicable licensing terms with
 * MediaTek Inc. and/or its licensors, any reproduction, modification, use or
 * disclosure of MediaTek Software, and information contained herein, in whole
 * or in part, shall be strictly prohibited.
*/

#ifdef __cplusplus
extern "C" {
#endif // __cplusplus

#ifndef REG_BASE_C_MODULE
// ----------------- WF_RX_DESCRIPTOR_G0 Bit Field Definitions -----------------

#define PACKING
/* SW manually fixed */
//typedef unsigned int FIELD;
#ifndef FIELD
typedef unsigned int FIELD;
#endif

typedef PACKING union
{
    PACKING struct
    {
        FIELD rx_byte_count             : 16; // 15- 0
        FIELD cosr                      :  1; // 16-16
        FIELD rsvd_26_17                : 10; // 26-17
        FIELD packet_type               :  5; // 31-27
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G0_DW00, *PREG_WF_RX_DESCRIPTOR_G0_DW00; // DW0

typedef PACKING union
{
    PACKING struct
    {
        FIELD mld_id                    : 12; // 11- 0
        FIELD rsvd_15_12                :  4; // 15-12
        FIELD group_vld                 :  5; // 20-16
        FIELD kid                       :  2; // 22-21
        FIELD cm                        :  1; // 23-23
        FIELD clm                       :  1; // 24-24
        FIELD i                         :  1; // 25-25
        FIELD t                         :  1; // 26-26
        FIELD bn                        :  2; // 28-27
        FIELD bipn_fail                 :  1; // 29-29
        FIELD rsvd_31_30                :  2; // 31-30
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G0_DW01, *PREG_WF_RX_DESCRIPTOR_G0_DW01; // DW1

typedef PACKING union
{
    PACKING struct
    {
        FIELD bssid                     :  6; //  5- 0
        FIELD rsvd_06_06                :  1; //  6- 6
        FIELD h                         :  1; //  7- 7
        FIELD header_length             :  5; // 12- 8
        FIELD ho                        :  3; // 15-13
        FIELD sec_mode                  :  5; // 20-16
        FIELD mubar                     :  1; // 21-21
        FIELD swbit                     :  1; // 22-22
        FIELD daf                       :  1; // 23-23
        FIELD el                        :  1; // 24-24
        FIELD htf                       :  1; // 25-25
        FIELD intf                      :  1; // 26-26
        FIELD frag                      :  1; // 27-27
        FIELD nul                       :  1; // 28-28
        FIELD ndata                     :  1; // 29-29
        FIELD namp                      :  1; // 30-30
        FIELD bf_rpt                    :  1; // 31-31
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G0_DW02, *PREG_WF_RX_DESCRIPTOR_G0_DW02; // DW2

typedef PACKING union
{
    PACKING struct
    {
        FIELD rxv_sn                    :  8; //  7- 0
        FIELD ch_frequency              :  8; // 15- 8
        FIELD a1_type                   :  2; // 17-16
        FIELD htc                       :  1; // 18-18
        FIELD tcl                       :  1; // 19-19
        FIELD bbm                       :  1; // 20-20
        FIELD bu                        :  1; // 21-21
        FIELD co_ant                    :  1; // 22-22
        FIELD bf_cqi                    :  1; // 23-23
        FIELD fc                        :  1; // 24-24
        FIELD rsvd_25_25                :  1; // 25-25
        FIELD ip                        :  1; // 26-26
        FIELD ut                        :  1; // 27-27
        FIELD rsvd_29_28                :  2; // 29-28
        FIELD smesh                     :  1; // 30-30
        FIELD vlan                      :  1; // 31-31
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G0_DW03, *PREG_WF_RX_DESCRIPTOR_G0_DW03; // DW3

typedef PACKING union
{
    PACKING struct
    {
        FIELD pf                        :  2; //  1- 0
        FIELD mac                       :  1; //  2- 2
        FIELD tid                       :  4; //  6- 3
        FIELD ether_type_offset         :  8; // 14- 7
        FIELD rsvd_15_15                :  1; // 15-15
        FIELD pse_fid                   : 13; // 28-16
        FIELD rsvd_31_29                :  3; // 31-29
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G0_DW04, *PREG_WF_RX_DESCRIPTOR_G0_DW04; // DW4

typedef PACKING union
{
    PACKING struct
    {
        FIELD rsvd_31_00                : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G0_DW05, *PREG_WF_RX_DESCRIPTOR_G0_DW05; // DW5

typedef PACKING union
{
    PACKING struct
    {
        FIELD cls_bitmap_31_0_          : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G0_PF_DW06, *PREG_WF_RX_DESCRIPTOR_G0_PF_DW06; // DW6

typedef PACKING union
{
    PACKING struct
    {
        FIELD cls_bitmap_33_32_         :  2; //  1- 0
        FIELD rsvd_18_02                : 17; // 18- 2
        FIELD dp                        :  1; // 19-19
        FIELD cls                       :  1; // 20-20
        FIELD ofld                      :  2; // 22-21
        FIELD mgc                       :  1; // 23-23
        FIELD wol                       :  5; // 28-24
        FIELD pf_mode                   :  1; // 29-29
        FIELD pf_sts                    :  2; // 31-30
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G0_PF_DW07, *PREG_WF_RX_DESCRIPTOR_G0_PF_DW07; // DW7

// ----------------- WF_RX_DESCRIPTOR_G0 Grouping Definitions  -----------------
// ----------------- WF_RX_DESCRIPTOR_G0 Register Definition   -----------------
typedef volatile PACKING struct
{
    REG_WF_RX_DESCRIPTOR_G0_DW00                 WF_RX_DESCRIPTOR_G0_DW00                ; // 0x0000
    REG_WF_RX_DESCRIPTOR_G0_DW01                 WF_RX_DESCRIPTOR_G0_DW01                ; // 0x0004
    REG_WF_RX_DESCRIPTOR_G0_DW02                 WF_RX_DESCRIPTOR_G0_DW02                ; // 0x0008
    REG_WF_RX_DESCRIPTOR_G0_DW03                 WF_RX_DESCRIPTOR_G0_DW03                ; // 0x000c
    REG_WF_RX_DESCRIPTOR_G0_DW04                 WF_RX_DESCRIPTOR_G0_DW04                ; // 0x0010
    REG_WF_RX_DESCRIPTOR_G0_DW05                 WF_RX_DESCRIPTOR_G0_DW05                ; // 0x0014
    REG_WF_RX_DESCRIPTOR_G0_PF_DW06              WF_RX_DESCRIPTOR_G0_PF_DW06             ; // 0x0018
    REG_WF_RX_DESCRIPTOR_G0_PF_DW07              WF_RX_DESCRIPTOR_G0_PF_DW07             ; // 0x001c
} WF_RX_DESCRIPTOR_REGS, *PWF_RX_DESCRIPTOR_REGS; // sw manually fixed
// ----------------- WF_RX_DESCRIPTOR_G0 Enum Definitions      -----------------
// ----------------- WF_RX_DESCRIPTOR_G0 C Macro Definitions   -----------------
// sw manually fixed
extern PWF_RX_DESCRIPTOR_REGS g_WF_RX_DESCRIPTOR_G0_BASE;

#define WF_RX_DESCRIPTOR_GROUP0_BASE (g_WF_RX_DESCRIPTOR_G0_BASE)
#define WF_RX_DESCRIPTOR_GROUP0_DW00                 INREG32(&WF_RX_DESCRIPTOR_GROUP0_BASE->WF_RX_DESCRIPTOR_G0_DW00                ) // 0x0000
#define WF_RX_DESCRIPTOR_GROUP0_DW01                 INREG32(&WF_RX_DESCRIPTOR_GROUP0_BASE->WF_RX_DESCRIPTOR_G0_DW01                ) // 0x0004
#define WF_RX_DESCRIPTOR_GROUP0_DW02                 INREG32(&WF_RX_DESCRIPTOR_GROUP0_BASE->WF_RX_DESCRIPTOR_G0_DW02                ) // 0x0008
