// generate by structure_parser.py at 2022-07-05 12:31:09
#ifndef __WF_RX_DESCRIPTOR_G5_REGS_H__
#define __WF_RX_DESCRIPTOR_G5_REGS_H__
/*
 * Copyright (c) 2022, MediaTek Inc. All rights reserved.
 *
 * This software/firmware and related documentation ("MediaTek Software") are
 * protected under relevant copyright laws.
 * The information contained herein is confidential and proprietary to
 * MediaTek Inc. and/or its licensors.
 * Except as otherwise provided in the applicable licensing terms with
 * MediaTek Inc. and/or its licensors, any reproduction, modification, use or
 * disclosure of MediaTek Software, and information contained herein, in whole
 * or in part, shall be strictly prohibited.
*/

#ifdef __cplusplus
extern "C" {
#endif // __cplusplus

#ifndef REG_BASE_C_MODULE
// ----------------- WF_RX_DESCRIPTOR_G5 Bit Field Definitions -----------------

#define PACKING
/* SW manually fixed */
//typedef unsigned int FIELD;
#ifndef FIELD
typedef unsigned int FIELD;
#endif

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW00, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW00; // DW0

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW01, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW01; // DW1

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW02, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW02; // DW2

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW03, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW03; // DW3

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW04, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW04; // DW4

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW05, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW05; // DW5

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW06, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW06; // DW6

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW07, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW07; // DW7

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW08, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW08; // DW8

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW09, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW09; // DW9

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW10, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW10; // DW10

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW11, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW11; // DW11

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW12, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW12; // DW12

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW13, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW13; // DW13

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW14, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW14; // DW14

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW15, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW15; // DW15

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW16, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW16; // DW16

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW17, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW17; // DW17

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW18, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW18; // DW18

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW19, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW19; // DW19

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW20, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW20; // DW20

typedef PACKING union
{
    PACKING struct
    {
        FIELD c_rxv                     : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW21, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW21; // DW21

typedef PACKING union
{
    PACKING struct
    {
        FIELD rsvd_31_00                : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW22, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW22; // DW22

typedef PACKING union
{
    PACKING struct
    {
        FIELD rsvd_31_00                : 32; // 31- 0
    } Bits;
    UINT32 Raw;
} REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW23, *PREG_WF_RX_DESCRIPTOR_G5_GROUP5_DW23; // DW23

// ----------------- WF_RX_DESCRIPTOR_G5 Grouping Definitions  -----------------
// ----------------- WF_RX_DESCRIPTOR_G5 Register Definition   -----------------
typedef volatile PACKING struct
{
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW00          WF_RX_DESCRIPTOR_G5_GROUP5_DW00         ; // 0x0000
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW01          WF_RX_DESCRIPTOR_G5_GROUP5_DW01         ; // 0x0004
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW02          WF_RX_DESCRIPTOR_G5_GROUP5_DW02         ; // 0x0008
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW03          WF_RX_DESCRIPTOR_G5_GROUP5_DW03         ; // 0x000c
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW04          WF_RX_DESCRIPTOR_G5_GROUP5_DW04         ; // 0x0010
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW05          WF_RX_DESCRIPTOR_G5_GROUP5_DW05         ; // 0x0014
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW06          WF_RX_DESCRIPTOR_G5_GROUP5_DW06         ; // 0x0018
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW07          WF_RX_DESCRIPTOR_G5_GROUP5_DW07         ; // 0x001c
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW08          WF_RX_DESCRIPTOR_G5_GROUP5_DW08         ; // 0x0020
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW09          WF_RX_DESCRIPTOR_G5_GROUP5_DW09         ; // 0x0024
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW10          WF_RX_DESCRIPTOR_G5_GROUP5_DW10         ; // 0x0028
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW11          WF_RX_DESCRIPTOR_G5_GROUP5_DW11         ; // 0x002c
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW12          WF_RX_DESCRIPTOR_G5_GROUP5_DW12         ; // 0x0030
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW13          WF_RX_DESCRIPTOR_G5_GROUP5_DW13         ; // 0x0034
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW14          WF_RX_DESCRIPTOR_G5_GROUP5_DW14         ; // 0x0038
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW15          WF_RX_DESCRIPTOR_G5_GROUP5_DW15         ; // 0x003c
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW16          WF_RX_DESCRIPTOR_G5_GROUP5_DW16         ; // 0x0040
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW17          WF_RX_DESCRIPTOR_G5_GROUP5_DW17         ; // 0x0044
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW18          WF_RX_DESCRIPTOR_G5_GROUP5_DW18         ; // 0x0048
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW19          WF_RX_DESCRIPTOR_G5_GROUP5_DW19         ; // 0x004c
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW20          WF_RX_DESCRIPTOR_G5_GROUP5_DW20         ; // 0x0050
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW21          WF_RX_DESCRIPTOR_G5_GROUP5_DW21         ; // 0x0054
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW22          WF_RX_DESCRIPTOR_G5_GROUP5_DW22         ; // 0x0058
    REG_WF_RX_DESCRIPTOR_G5_GROUP5_DW23          WF_RX_DESCRIPTOR_G5_GROUP5_DW23         ; // 0x005c
} WF_RX_DESCRIPTOR_GROUP5_REGS, *PWF_RX_DESCRIPTOR_GROUP5_REGS;// sw manually fixed
// ----------------- WF_RX_DESCRIPTOR_G5 Enum Definitions      -----------------
// ----------------- WF_RX_DESCRIPTOR_G5 C Macro Definitions   -----------------
// sw manually fixed
extern PWF_RX_DESCRIPTOR_GROUP5_REGS g_WF_RX_DESCRIPTOR_G5_BASE;

#define WF_RX_DESCRIPTOR_GROUP5_BASE (g_WF_RX_DESCRIPTOR_G5_BASE)
#define WF_RX_DESCRIPTOR_GROUP5_DW00          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW00         ) // 0x0000
#define WF_RX_DESCRIPTOR_GROUP5_DW01          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW01         ) // 0x0004
#define WF_RX_DESCRIPTOR_GROUP5_DW02          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW02         ) // 0x0008
#define WF_RX_DESCRIPTOR_GROUP5_DW03          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW03         ) // 0x000c
#define WF_RX_DESCRIPTOR_GROUP5_DW04          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW04         ) // 0x0010
#define WF_RX_DESCRIPTOR_GROUP5_DW05          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW05         ) // 0x0014
#define WF_RX_DESCRIPTOR_GROUP5_DW06          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW06         ) // 0x0018
#define WF_RX_DESCRIPTOR_GROUP5_DW07          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW07         ) // 0x001c
#define WF_RX_DESCRIPTOR_GROUP5_DW08          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW08         ) // 0x0020
#define WF_RX_DESCRIPTOR_GROUP5_DW09          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW09         ) // 0x0024
#define WF_RX_DESCRIPTOR_GROUP5_DW10          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW10         ) // 0x0028
#define WF_RX_DESCRIPTOR_GROUP5_DW11          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW11         ) // 0x002c
#define WF_RX_DESCRIPTOR_GROUP5_DW12          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW12         ) // 0x0030
#define WF_RX_DESCRIPTOR_GROUP5_DW13          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW13         ) // 0x0034
#define WF_RX_DESCRIPTOR_GROUP5_DW14          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW14         ) // 0x0038
#define WF_RX_DESCRIPTOR_GROUP5_DW15          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW15         ) // 0x003c
#define WF_RX_DESCRIPTOR_GROUP5_DW16          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW16         ) // 0x0040
#define WF_RX_DESCRIPTOR_GROUP5_DW17          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW17         ) // 0x0044
#define WF_RX_DESCRIPTOR_GROUP5_DW18          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW18         ) // 0x0048
#define WF_RX_DESCRIPTOR_GROUP5_DW19          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW19         ) // 0x004c
#define WF_RX_DESCRIPTOR_GROUP5_DW20          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW20         ) // 0x0050
#define WF_RX_DESCRIPTOR_GROUP5_DW21          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW21         ) // 0x0054
#define WF_RX_DESCRIPTOR_GROUP5_DW22          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW22         ) // 0x0058
#define WF_RX_DESCRIPTOR_GROUP5_DW23          INREG32(&WF_RX_DESCRIPTOR_GROUP5_BASE->WF_RX_DESCRIPTOR_G5_GROUP5_DW23         ) // 0x005c

#endif // REG_BASE_C_MODULE

// DW0
#define WF_RX_DESCRIPTOR_G5_C_RXV_DW                                           0
#define WF_RX_DESCRIPTOR_G5_C_RXV_ADDR                                         0
#define WF_RX_DESCRIPTOR_G5_C_RXV_MASK                                         0xffffffff // 31- 0
#define WF_RX_DESCRIPTOR_G5_C_RXV_SHIFT                                        0
// DW1
// DO NOT process repeat field(c_rxv)
// DW2
// DO NOT process repeat field(c_rxv)
// DW3
// DO NOT process repeat field(c_rxv)
// DW4
// DO NOT process repeat field(c_rxv)
// DW5
// DO NOT process repeat field(c_rxv)
// DW6
// DO NOT process repeat field(c_rxv)
// DW7
// DO NOT process repeat field(c_rxv)
// DW8
// DO NOT process repeat field(c_rxv)
// DW9
// DO NOT process repeat field(c_rxv)
// DW10
// DO NOT process repeat field(c_rxv)
// DW11
// DO NOT process repeat field(c_rxv)
// DW12
// DO NOT process repeat field(c_rxv)
// DW13
// DO NOT process repeat field(c_rxv)
// DW14
// DO NOT process repeat field(c_rxv)
// DW15
// DO NOT process repeat field(c_rxv)
// DW16
// DO NOT process repeat field(c_rxv)
// DW17
// DO NOT process repeat field(c_rxv)
// DW18
// DO NOT process repeat field(c_rxv)
// DW19
// DO NOT process repeat field(c_rxv)
// DW20
// DO NOT process repeat field(c_rxv)
// DW21
// DO NOT process repeat field(c_rxv)
// DW22
// DW23

// DW0
#define HAL_RX_STATUS_GET_C_RXV(reg32)                                                                      READ_FIELD((reg32), WF_RX_DESCRIPTOR_G5_C_RXV)
// DW1
// DO NOT process repeat field(c_rxv)
// DW2
// DO NOT process repeat field(c_rxv)
// DW3
// DO NOT process repeat field(c_rxv)
// DW4
// DO NOT process repeat field(c_rxv)
// DW5
// DO NOT process repeat field(c_rxv)
// DW6
// DO NOT process repeat field(c_rxv)
// DW7
// DO NOT process repeat field(c_rxv)
// DW8
// DO NOT process repeat field(c_rxv)
// DW9
// DO NOT process repeat field(c_rxv)
// DW10
// DO NOT process repeat field(c_rxv)
// DW11
// DO NOT process repeat field(c_rxv)
// DW12
// DO NOT process repeat field(c_rxv)
// DW13
// DO NOT process repeat field(c_rxv)
// DW14
// DO NOT process repeat field(c_rxv)
// DW15
// DO NOT process repeat field(c_rxv)
// DW16
// DO NOT process repeat field(c_rxv)
// DW17
// DO NOT process repeat field(c_rxv)
// DW18
// DO NOT process repeat field(c_rxv)
// DW19
// DO NOT process repeat field(c_rxv)
// DW20
// DO NOT process repeat field(c_rxv)
// DW21
// DO NOT process repeat field(c_rxv)
// DW22
// DW23

// DW0
#define HAL_RX_STATUS_SET_C_RXV(reg32, val32)                                                               WRITE_FIELD((reg32), WF_RX_DESCRIPTOR_G5_C_RXV, val32)
// DW1
// DO NOT process repeat field(c_rxv)
// DW2
// DO NOT process repeat field(c_rxv)
// DW3
// DO NOT process repeat field(c_rxv)
// DW4
// DO NOT process repeat field(c_rxv)
// DW5
// DO NOT process repeat field(c_rxv)
// DW6
// DO NOT process repeat field(c_rxv)
// DW7
// DO NOT process repeat field(c_rxv)
// DW8
// DO NOT process repeat field(c_rxv)
// DW9
// DO NOT process repeat field(c_rxv)
// DW10
// DO NOT process repeat field(c_rxv)
// DW11
// DO NOT process repeat field(c_rxv)
// DW12
// DO NOT process repeat field(c_rxv)
// DW13
// DO NOT process repeat field(c_rxv)
// DW14
// DO NOT process repeat field(c_rxv)
// DW15
// DO NOT process repeat field(c_rxv)
// DW16
// DO NOT process repeat field(c_rxv)
// DW17
// DO NOT process repeat field(c_rxv)
// DW18
// DO NOT process repeat field(c_rxv)
// DW19
// DO NOT process repeat field(c_rxv)
// DW20
// DO NOT process repeat field(c_rxv)
// DW21
// DO NOT process repeat field(c_rxv)
// DW22
// DW23

// DW0
#define HAL_RX_STATUS_CLR_C_RXV(reg32)                                                                      CLEAR_FIELD((reg32), WF_RX_DESCRIPTOR_G5_C_RXV)
// DW1
// DO NOT process repeat field(c_rxv)
// DW2
// DO NOT process repeat field(c_rxv)
// DW3
// DO NOT process repeat field(c_rxv)
// DW4
// DO NOT process repeat field(c_rxv)
// DW5
// DO NOT process repeat field(c_rxv)
// DW6
// DO NOT process repeat field(c_rxv)
// DW7
// DO NOT process repeat field(c_rxv)
// DW8
// DO NOT process repeat field(c_rxv)
// DW9
// DO NOT process repeat field(c_rxv)
// DW10
// DO NOT process repeat field(c_rxv)
// DW11
// DO NOT process repeat field(c_rxv)
// DW12
// DO NOT process repeat field(c_rxv)
// DW13
// DO NOT process repeat field(c_rxv)
// DW14
// DO NOT process repeat field(c_rxv)
// DW15
// DO NOT process repeat field(c_rxv)
// DW16
// DO NOT process repeat field(c_rxv)
// DW17
// DO NOT process repeat field(c_rxv)
// DW18
// DO NOT process repeat field(c_rxv)
// DW19
// DO NOT process repeat field(c_rxv)
// DW20
// DO NOT process repeat field(c_rxv)
// DW21
// DO NOT process repeat field(c_rxv)
// DW22
// DW23

#ifdef __cplusplus
}
#endif // __cplusplus
#endif // __WF_RX_DESCRIPTOR_G5_REGS_H__
