Repository: sfwtw/imm-mt7987
Catalog: package/custom/luci-app-fancontrol/po/*/fancontrol.po
Languages: ru

source: Fan Control
ru: Управление вентилятором

source: Settings
ru: Настройки

source: Enable
ru: Включить

source: Thermal File
ru: Файл температуры

source: Fan File
ru: Файл управления вентилятором

source: Fan Speed File
ru: Файл скорости вентилятора

source: Initial Speed
ru: Начальная скорость

source: Please enter the initial speed for fan startup.
ru: Введите начальную скорость при запуске вентилятора.

source: Max Speed
ru: Максимальная скорость

source: Please enter maximum fan speed.
ru: Введите максимальную скорость вентилятора.

source: Start Temperature
ru: Температура запуска

source: Please enter the fan start temperature.
ru: Введите температуру запуска вентилятора.

source: Current speed:
ru: Текущая скорость:

source: Current temperature:
ru: Текущая температура:
